RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b510f1024il120.h
/* Bit fields for EMU VMONIO0CTRL */
#define _EMU_VMONIO0CTRL_RESETVALUE                          0x00000000UL                                 /**< Default value for EMU_VMONIO0CTRL */
#define _EMU_VMONIO0CTRL_MASK                                0x0000FF1DUL                                 /**< Mask for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_EN                                   (0x1UL << 0)                                 /**< Enable */
#define _EMU_VMONIO0CTRL_EN_SHIFT                            0                                            /**< Shift value for EMU_EN */
#define _EMU_VMONIO0CTRL_EN_MASK                             0x1UL                                        /**< Bit mask for EMU_EN */
#define _EMU_VMONIO0CTRL_EN_DEFAULT                          0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_EN_DEFAULT                           (_EMU_VMONIO0CTRL_EN_DEFAULT << 0)           /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_RISEWU                               (0x1UL << 2)                                 /**< Rise Wakeup */
#define _EMU_VMONIO0CTRL_RISEWU_SHIFT                        2                                            /**< Shift value for EMU_RISEWU */
#define _EMU_VMONIO0CTRL_RISEWU_MASK                         0x4UL                                        /**< Bit mask for EMU_RISEWU */
#define _EMU_VMONIO0CTRL_RISEWU_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_RISEWU_DEFAULT                       (_EMU_VMONIO0CTRL_RISEWU_DEFAULT << 2)       /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_FALLWU                               (0x1UL << 3)                                 /**< Fall Wakeup */
#define _EMU_VMONIO0CTRL_FALLWU_SHIFT                        3                                            /**< Shift value for EMU_FALLWU */
#define _EMU_VMONIO0CTRL_FALLWU_MASK                         0x8UL                                        /**< Bit mask for EMU_FALLWU */
#define _EMU_VMONIO0CTRL_FALLWU_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_FALLWU_DEFAULT                       (_EMU_VMONIO0CTRL_FALLWU_DEFAULT << 3)       /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_RETDIS                               (0x1UL << 4)                                 /**< EM4 IO0 Retention Disable */
#define _EMU_VMONIO0CTRL_RETDIS_SHIFT                        4                                            /**< Shift value for EMU_RETDIS */
#define _EMU_VMONIO0CTRL_RETDIS_MASK                         0x10UL                                       /**< Bit mask for EMU_RETDIS */
#define _EMU_VMONIO0CTRL_RETDIS_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_RETDIS_DEFAULT                       (_EMU_VMONIO0CTRL_RETDIS_DEFAULT << 4)       /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */
#define _EMU_VMONIO0CTRL_THRESFINE_SHIFT                     8                                            /**< Shift value for EMU_THRESFINE */
#define _EMU_VMONIO0CTRL_THRESFINE_MASK                      0xF00UL                                      /**< Bit mask for EMU_THRESFINE */
#define _EMU_VMONIO0CTRL_THRESFINE_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_THRESFINE_DEFAULT                    (_EMU_VMONIO0CTRL_THRESFINE_DEFAULT << 8)    /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */
#define _EMU_VMONIO0CTRL_THRESCOARSE_SHIFT                   12                                           /**< Shift value for EMU_THRESCOARSE */
#define _EMU_VMONIO0CTRL_THRESCOARSE_MASK                    0xF000UL                                     /**< Bit mask for EMU_THRESCOARSE */
#define _EMU_VMONIO0CTRL_THRESCOARSE_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_THRESCOARSE_DEFAULT                  (_EMU_VMONIO0CTRL_THRESCOARSE_DEFAULT << 12) /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */

/* Bit fields for EMU VMONIO1CTRL */
#define _EMU_VMONIO1CTRL_RESETVALUE                          0x00000000UL                                 /**< Default value for EMU_VMONIO1CTRL */
#define _EMU_VMONIO1CTRL_MASK                                0x0000FF1DUL                                 /**< Mask for EMU_VMONIO1CTRL */
#define EMU_VMONIO1CTRL_EN                                   (0x1UL << 0)                                 /**< Enable */
#define _EMU_VMONIO1CTRL_EN_SHIFT                            0                                            /**< Shift value for EMU_EN */
#define _EMU_VMONIO1CTRL_EN_MASK                             0x1UL                                        /**< Bit mask for EMU_EN */
#define _EMU_VMONIO1CTRL_EN_DEFAULT                          0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO1CTRL */
#define EMU_VMONIO1CTRL_EN_DEFAULT                           (_EMU_VMONIO1CTRL_EN_DEFAULT << 0)           /**< Shifted mode DEFAULT for EMU_VMONIO1CTRL */
#define EMU_VMONIO1CTRL_RISEWU                               (0x1UL << 2)                                 /**< Rise Wakeup */
#define _EMU_VMONIO1CTRL_RISEWU_SHIFT                        2                                            /**< Shift value for EMU_RISEWU */
#define _EMU_VMONIO1CTRL_RISEWU_MASK                         0x4UL                                        /**< Bit mask for EMU_RISEWU */
#define _EMU_VMONIO1CTRL_RISEWU_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO1CTRL */
#define EMU_VMONIO1CTRL_RISEWU_DEFAULT                       (_EMU_VMONIO1CTRL_RISEWU_DEFAULT << 2)       /**< Shifted mode DEFAULT for EMU_VMONIO1CTRL */
#define EMU_VMONIO1CTRL_FALLWU                               (0x1UL << 3)                                 /**< Fall Wakeup */
#define _EMU_VMONIO1CTRL_FALLWU_SHIFT                        3                                            /**< Shift value for EMU_FALLWU */
#define _EMU_VMONIO1CTRL_FALLWU_MASK                         0x8UL                                        /**< Bit mask for EMU_FALLWU */
#define _EMU_VMONIO1CTRL_FALLWU_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO1CTRL */
#define EMU_VMONIO1CTRL_FALLWU_DEFAULT                       (_EMU_VMONIO1CTRL_FALLWU_DEFAULT << 3)       /**< Shifted mode DEFAULT for EMU_VMONIO1CTRL */
#define EMU_VMONIO1CTRL_RETDIS                               (0x1UL << 4)                                 /**< EM4 IO1 Retention Disable */
#define _EMU_VMONIO1CTRL_RETDIS_SHIFT                        4                                            /**< Shift value for EMU_RETDIS */
#define _EMU_VMONIO1CTRL_RETDIS_MASK                         0x10UL                                       /**< Bit mask for EMU_RETDIS */
#define _EMU_VMONIO1CTRL_RETDIS_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO1CTRL */
#define EMU_VMONIO1CTRL_RETDIS_DEFAULT                       (_EMU_VMONIO1CTRL_RETDIS_DEFAULT << 4)       /**< Shifted mode DEFAULT for EMU_VMONIO1CTRL */
#define _EMU_VMONIO1CTRL_THRESFINE_SHIFT                     8                                            /**< Shift value for EMU_THRESFINE */
#define _EMU_VMONIO1CTRL_THRESFINE_MASK                      0xF00UL                                      /**< Bit mask for EMU_THRESFINE */
#define _EMU_VMONIO1CTRL_THRESFINE_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO1CTRL */
#define EMU_VMONIO1CTRL_THRESFINE_DEFAULT                    (_EMU_VMONIO1CTRL_THRESFINE_DEFAULT << 8)    /**< Shifted mode DEFAULT for EMU_VMONIO1CTRL */
#define _EMU_VMONIO1CTRL_THRESCOARSE_SHIFT                   12                                           /**< Shift value for EMU_THRESCOARSE */
#define _EMU_VMONIO1CTRL_THRESCOARSE_MASK                    0xF000UL                                     /**< Bit mask for EMU_THRESCOARSE */
#define _EMU_VMONIO1CTRL_THRESCOARSE_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO1CTRL */
#define EMU_VMONIO1CTRL_THRESCOARSE_DEFAULT                  (_EMU_VMONIO1CTRL_THRESCOARSE_DEFAULT << 12) /**< Shifted mode DEFAULT for EMU_VMONIO1CTRL */

/* Bit fields for EMU VMONBUVDDCTRL */
#define _EMU_VMONBUVDDCTRL_RESETVALUE                        0x00000000UL                                   /**< Default value for EMU_VMONBUVDDCTRL */
#define _EMU_VMONBUVDDCTRL_MASK                              0x0000FF0DUL                                   /**< Mask for EMU_VMONBUVDDCTRL */
#define EMU_VMONBUVDDCTRL_EN                                 (0x1UL << 0)                                   /**< Enable */
#define _EMU_VMONBUVDDCTRL_EN_SHIFT                          0                                              /**< Shift value for EMU_EN */
#define _EMU_VMONBUVDDCTRL_EN_MASK                           0x1UL                                          /**< Bit mask for EMU_EN */
#define _EMU_VMONBUVDDCTRL_EN_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for EMU_VMONBUVDDCTRL */
#define EMU_VMONBUVDDCTRL_EN_DEFAULT                         (_EMU_VMONBUVDDCTRL_EN_DEFAULT << 0)           /**< Shifted mode DEFAULT for EMU_VMONBUVDDCTRL */
#define EMU_VMONBUVDDCTRL_RISEWU                             (0x1UL << 2)                                   /**< Rise Wakeup */
#define _EMU_VMONBUVDDCTRL_RISEWU_SHIFT                      2                                              /**< Shift value for EMU_RISEWU */
#define _EMU_VMONBUVDDCTRL_RISEWU_MASK                       0x4UL                                          /**< Bit mask for EMU_RISEWU */
#define _EMU_VMONBUVDDCTRL_RISEWU_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for EMU_VMONBUVDDCTRL */
#define EMU_VMONBUVDDCTRL_RISEWU_DEFAULT                     (_EMU_VMONBUVDDCTRL_RISEWU_DEFAULT << 2)       /**< Shifted mode DEFAULT for EMU_VMONBUVDDCTRL */
#define EMU_VMONBUVDDCTRL_FALLWU                             (0x1UL << 3)                                   /**< Fall Wakeup */
#define _EMU_VMONBUVDDCTRL_FALLWU_SHIFT                      3                                              /**< Shift value for EMU_FALLWU */
#define _EMU_VMONBUVDDCTRL_FALLWU_MASK                       0x8UL                                          /**< Bit mask for EMU_FALLWU */
#define _EMU_VMONBUVDDCTRL_FALLWU_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for EMU_VMONBUVDDCTRL */
#define EMU_VMONBUVDDCTRL_FALLWU_DEFAULT                     (_EMU_VMONBUVDDCTRL_FALLWU_DEFAULT << 3)       /**< Shifted mode DEFAULT for EMU_VMONBUVDDCTRL */
#define _EMU_VMONBUVDDCTRL_THRESFINE_SHIFT                   8                                              /**< Shift value for EMU_THRESFINE */
#define _EMU_VMONBUVDDCTRL_THRESFINE_MASK                    0xF00UL                                        /**< Bit mask for EMU_THRESFINE */
#define _EMU_VMONBUVDDCTRL_THRESFINE_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for EMU_VMONBUVDDCTRL */
#define EMU_VMONBUVDDCTRL_THRESFINE_DEFAULT                  (_EMU_VMONBUVDDCTRL_THRESFINE_DEFAULT << 8)    /**< Shifted mode DEFAULT for EMU_VMONBUVDDCTRL */
#define _EMU_VMONBUVDDCTRL_THRESCOARSE_SHIFT                 12                                             /**< Shift value for EMU_THRESCOARSE */
#define _EMU_VMONBUVDDCTRL_THRESCOARSE_MASK                  0xF000UL                                       /**< Bit mask for EMU_THRESCOARSE */
#define _EMU_VMONBUVDDCTRL_THRESCOARSE_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for EMU_VMONBUVDDCTRL */
#define EMU_VMONBUVDDCTRL_THRESCOARSE_DEFAULT                (_EMU_VMONBUVDDCTRL_THRESCOARSE_DEFAULT << 12) /**< Shifted mode DEFAULT for EMU_VMONBUVDDCTRL */

/* Bit fields for EMU RAM1CTRL */
#define _EMU_RAM1CTRL_RESETVALUE                             0x00000000UL                              /**< Default value for EMU_RAM1CTRL */
#define _EMU_RAM1CTRL_MASK                                   0x0000000FUL                              /**< Mask for EMU_RAM1CTRL */
#define _EMU_RAM1CTRL_RAMPOWERDOWN_SHIFT                     0                                         /**< Shift value for EMU_RAMPOWERDOWN */
#define _EMU_RAM1CTRL_RAMPOWERDOWN_MASK                      0xFUL                                     /**< Bit mask for EMU_RAMPOWERDOWN */
#define _EMU_RAM1CTRL_RAMPOWERDOWN_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for EMU_RAM1CTRL */
#define _EMU_RAM1CTRL_RAMPOWERDOWN_NONE                      0x00000000UL                              /**< Mode NONE for EMU_RAM1CTRL */
#define _EMU_RAM1CTRL_RAMPOWERDOWN_BLK3                      0x00000008UL                              /**< Mode BLK3 for EMU_RAM1CTRL */
#define _EMU_RAM1CTRL_RAMPOWERDOWN_BLK2TO3                   0x0000000CUL                              /**< Mode BLK2TO3 for EMU_RAM1CTRL */
#define _EMU_RAM1CTRL_RAMPOWERDOWN_BLK1TO3                   0x0000000EUL                              /**< Mode BLK1TO3 for EMU_RAM1CTRL */
#define _EMU_RAM1CTRL_RAMPOWERDOWN_BLK0TO3                   0x0000000FUL                              /**< Mode BLK0TO3 for EMU_RAM1CTRL */
#define EMU_RAM1CTRL_RAMPOWERDOWN_DEFAULT                    (_EMU_RAM1CTRL_RAMPOWERDOWN_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_RAM1CTRL */
#define EMU_RAM1CTRL_RAMPOWERDOWN_NONE                       (_EMU_RAM1CTRL_RAMPOWERDOWN_NONE << 0)    /**< Shifted mode NONE for EMU_RAM1CTRL */
#define EMU_RAM1CTRL_RAMPOWERDOWN_BLK3                       (_EMU_RAM1CTRL_RAMPOWERDOWN_BLK3 << 0)    /**< Shifted mode BLK3 for EMU_RAM1CTRL */
#define EMU_RAM1CTRL_RAMPOWERDOWN_BLK2TO3                    (_EMU_RAM1CTRL_RAMPOWERDOWN_BLK2TO3 << 0) /**< Shifted mode BLK2TO3 for EMU_RAM1CTRL */
#define EMU_RAM1CTRL_RAMPOWERDOWN_BLK1TO3                    (_EMU_RAM1CTRL_RAMPOWERDOWN_BLK1TO3 << 0) /**< Shifted mode BLK1TO3 for EMU_RAM1CTRL */
#define EMU_RAM1CTRL_RAMPOWERDOWN_BLK0TO3                    (_EMU_RAM1CTRL_RAMPOWERDOWN_BLK0TO3 << 0) /**< Shifted mode BLK0TO3 for EMU_RAM1CTRL */

/* Bit fields for EMU RAM2CTRL */
#define _EMU_RAM2CTRL_RESETVALUE                             0x00000000UL                              /**< Default value for EMU_RAM2CTRL */
#define _EMU_RAM2CTRL_MASK                                   0x0000000FUL                              /**< Mask for EMU_RAM2CTRL */
#define _EMU_RAM2CTRL_RAMPOWERDOWN_SHIFT                     0                                         /**< Shift value for EMU_RAMPOWERDOWN */
#define _EMU_RAM2CTRL_RAMPOWERDOWN_MASK                      0xFUL                                     /**< Bit mask for EMU_RAMPOWERDOWN */
#define _EMU_RAM2CTRL_RAMPOWERDOWN_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for EMU_RAM2CTRL */
#define _EMU_RAM2CTRL_RAMPOWERDOWN_NONE                      0x00000000UL                              /**< Mode NONE for EMU_RAM2CTRL */
#define _EMU_RAM2CTRL_RAMPOWERDOWN_BLK3                      0x00000008UL                              /**< Mode BLK3 for EMU_RAM2CTRL */
#define _EMU_RAM2CTRL_RAMPOWERDOWN_BLK2TO3                   0x0000000CUL                              /**< Mode BLK2TO3 for EMU_RAM2CTRL */
#define _EMU_RAM2CTRL_RAMPOWERDOWN_BLK1TO3                   0x0000000EUL                              /**< Mode BLK1TO3 for EMU_RAM2CTRL */
#define _EMU_RAM2CTRL_RAMPOWERDOWN_BLK0TO3                   0x0000000FUL                              /**< Mode BLK0TO3 for EMU_RAM2CTRL */
#define EMU_RAM2CTRL_RAMPOWERDOWN_DEFAULT                    (_EMU_RAM2CTRL_RAMPOWERDOWN_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_RAM2CTRL */
#define EMU_RAM2CTRL_RAMPOWERDOWN_NONE                       (_EMU_RAM2CTRL_RAMPOWERDOWN_NONE << 0)    /**< Shifted mode NONE for EMU_RAM2CTRL */
#define EMU_RAM2CTRL_RAMPOWERDOWN_BLK3                       (_EMU_RAM2CTRL_RAMPOWERDOWN_BLK3 << 0)    /**< Shifted mode BLK3 for EMU_RAM2CTRL */
#define EMU_RAM2CTRL_RAMPOWERDOWN_BLK2TO3                    (_EMU_RAM2CTRL_RAMPOWERDOWN_BLK2TO3 << 0) /**< Shifted mode BLK2TO3 for EMU_RAM2CTRL */
#define EMU_RAM2CTRL_RAMPOWERDOWN_BLK1TO3                    (_EMU_RAM2CTRL_RAMPOWERDOWN_BLK1TO3 << 0) /**< Shifted mode BLK1TO3 for EMU_RAM2CTRL */
#define EMU_RAM2CTRL_RAMPOWERDOWN_BLK0TO3                    (_EMU_RAM2CTRL_RAMPOWERDOWN_BLK0TO3 << 0) /**< Shifted mode BLK0TO3 for EMU_RAM2CTRL */

